Ran Plan for project: `prod` dir: `terraform-test/gce-new` workspace: `prod`

<details><summary>Show Output</summary>

```diff
Planning prod workflow

Success! The configuration is valid.



Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.web_server will be created
+ resource "google_compute_instance" "web_server" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + labels                  = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            apt-get update
            apt-get install -y nginx htop curl fail2ban ufw
            
            # Configure firewall
            ufw allow OpenSSH
            ufw allow 'Nginx Full'
            ufw --force enable
            
            # Start services
            systemctl start nginx
            systemctl enable nginx
            systemctl start fail2ban
            systemctl enable fail2ban
            
            # Create a simple page
            echo "<h1>Production Server - Terraform Managed</h1>" > /var/www/html/index.html
            echo "<p>Server: $(hostname)</p>" >> /var/www/html/index.html
            echo "<p>Deployed: $(date)</p>" >> /var/www/html/index.html
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "prod-server-atlantis-new"
      + project                 = "searce-playground-v2"
      + self_link               = (known after apply)
      + tags                    = [
          + "web-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + zone                    = "asia-south1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-12"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 30
              + type                   = "pd-standard"
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "pilot-training-2025-vpc"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "devansh-subnet"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "pilot-training-2025-sa@searce-playground-v2.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_external_ip = (known after apply)
+ instance_internal_ip = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://devansh-atlantis.searceinc.net/lock?id=dev4901%252FTest-github-actions%252Fterraform-test%252Fgce-new%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```